# -*- coding: utf-8 -*-
# @Project: 芒果测试平台
# @Description: 错误消息统一管理
# @Time   : 2024-02-01 10:00
# @Author : 毛鹏
ERROR_MSG_0001 = (301, '连接错误，请检查IP，端口，账号，密码')
ERROR_MSG_0002 = (302, '缓存中无法获取到：{}的值')
ERROR_MSG_0003 = (303, 'jsonpath表达式错误，请检查表达式：{}')
ERROR_MSG_0004 = (304, '数据不可以被转换成json')
ERROR_MSG_0006 = (306, '随机字符串函数只支持传入int类型数字')
ERROR_MSG_0013 = (
    313, '打开url时超时，分为2个问题：1.启用的浏览器过多，应当减少浏览器并发个数；2.自行查看为啥60秒还未打开：{}')
ERROR_MSG_0014 = (314, '元素的类型错误，请联系管理员进行排查问题')
ERROR_MSG_0016 = (316, '邮件发送失败，请检查邮件的配置')
ERROR_MSG_0017 = (317, '断言失败，请检查用例断言')
ERROR_MSG_0018 = (318, 'webhook的链接错误！')
ERROR_MSG_0019 = (319, '配置了sql断言，但是并没有配置mysql的数据库配置，请检查！用例id：{}，步骤ID：{}')
ERROR_MSG_0020 = (320, '没有更多的断言方式，请检查是否选择了非该设备类型的元素定位方式')
ERROR_MSG_0028 = (328, '一个元素内只能包含一个需要被替换的内容')
ERROR_MSG_0033 = (333, 'mysql中无：{}库')
ERROR_MSG_0034 = (334, 'sql存在语法错误，sql：{}')
ERROR_MSG_0035 = (335, 'sql语句是空，或查询字段或条件字段不存在')
ERROR_MSG_0047 = (347, '方法不存在，请检查输入的方法名称是否正确')
